the-belt.md

# Table of Contents

1.  [Objective](#orgbf6d192)



<a id="orgbf6d192"></a>

# Objective

Outline a set of software modules for solving the most common problems encountered.
This set differentiates itself from [The Shelf](the-shelf.md) in that it lives only in the
realm of software, no relation to the hardware involved, although, it is expected
to run on embedded platforms. It might be clearer just to show you a list:

-   HashMap (Unordered Map)
-   FI{F,L}O Queue
-   Linear Algebra
-   Data Compression

